# Joins

# Introduction

This Jupyter notebook explores SQL joins using Python.

In [1]:
import pandas as pd

In [2]:
left_table = pd.read_excel('left_table.xlsx', 'Sheet1')
#left_table = pd.read_csv('left_table.csv')

In [3]:
left_table.head()

        ID             Employee           Equipment  Qty
0  64566.0           Debra Aten  Laptop 12" SC1 SH2    1
1      NaN                  NaN     Monitor 22" SC1    1
2  67059.0       Marcia Paulsen  Laptop 12" SC1 SH2    1
3      NaN                  NaN     Monitor 22" SC1    2
4  67127.0  Stephen Krumpack Jr  Laptop 12" SC1 SH2    1

In [4]:
left_table.shape

(638, 4)

In [5]:
left_table.insert(loc=2, column='Desk Location', value='')

In [6]:
left_table.head()

        ID             Employee Desk Location           Equipment  Qty
0  64566.0           Debra Aten                Laptop 12" SC1 SH2    1
1      NaN                  NaN                   Monitor 22" SC1    1
2  67059.0       Marcia Paulsen                Laptop 12" SC1 SH2    1
3      NaN                  NaN                   Monitor 22" SC1    2
4  67127.0  Stephen Krumpack Jr                Laptop 12" SC1 SH2    1

In [7]:
left_table.dtypes

ID               float64
Employee          object
Desk Location     object
Equipment         object
Qty                int64
dtype: object

In [8]:
right_table = pd.read_excel('right_table.xlsx', 'Sheet1')
#right_table = pd.read_csv('right_table.csv')

In [9]:
right_table.head()

                Names Desk Location      Laptop       Monitors
0  Christian Herrmann        30-001           1         1 24in
1     Matthias Ruegge        30-003           1         1 24in
2       Harrison Dobe        30-004  1 Macbook   1 Mac Monitor
3        Ross Duchene        30-005           1              2
4        Denise Lauer        30-006           1         1 24in

In [10]:
right_table.dtypes

Names            object
Desk Location    object
Laptop           object
Monitors         object
dtype: object

In [11]:
left_table['Desk Location'] = left_table[['Employee']]\
    .merge(right_table[['Names', 'Desk Location']],\
                         left_on='Employee', \
                         right_on='Names', \
                         how='left')['Desk Location'].values

In [12]:
left_table.head(10)

        ID                 Employee Desk Location           Equipment  Qty
0  64566.0               Debra Aten           NaN  Laptop 12" SC1 SH2    1
1      NaN                      NaN           NaN     Monitor 22" SC1    1
2  67059.0           Marcia Paulsen        30-014  Laptop 12" SC1 SH2    1
3      NaN                      NaN           NaN     Monitor 22" SC1    2
4  67127.0      Stephen Krumpack Jr           NaN  Laptop 12" SC1 SH2    1
5  67128.0         Kimberly Tentler           NaN  Laptop 12" SC1 SH2    1
6  67131.0  Kelly Klein-Bartkiewicz        30-110  Laptop 14" SC1 SH2    1
7      NaN                      NaN           NaN     Monitor 22" SC1    2
8  67132.0            Robert Stella           NaN  Laptop 14" SC1 SH2    1
9      NaN                      NaN           NaN  Laptop 12" SC1 SH2    1

In [13]:
# These are the 'Employee' that were not assigned a 'Desk Location',
# therefore, the 'Names' is not present or not spelled the same
# in right_table.
left_table[['ID', 'Employee']][left_table['Desk Location'].isnull()].head(10)

         ID             Employee
0   64566.0           Debra Aten
1       NaN                  NaN
3       NaN                  NaN
4   67127.0  Stephen Krumpack Jr
5   67128.0     Kimberly Tentler
7       NaN                  NaN
8   67132.0        Robert Stella
9       NaN                  NaN
10      NaN                  NaN
11  67164.0           Winnie Kuo